console.log('Завдання: 1 ==============================')

// Функція task1 не приймає жодних аргументів
function task1() {
  /**
   * Функція `getData` симулює отримання даних з асинхронного джерела,такого як запит до бази даних або API.
   *
   *  data - вхідні дані.
   *  timeout - час в мілісекундах, який витрачається на отримання даних,за замовчуванням 2000мс.
   */
  function getData(data, timeout = 2000) {
    // Функція повертає новий проміс
    // За допомогою setTimeout ми симулюємо затримку timeout, яка виникає при роботі з асинхронними джерелами даних
    // Якщо об'єкт не пустий, ми викликаємо resolve з data
    // Якщо об'єкт пустий, ми викликаємо reject з новим об'єктом Error("Об'єкт пустий")
    return new Promise((resolve, reject) => {
      setTimeout(() => {
        Object.keys(data).length
          ? resolve(data)
          : reject(new Error("Об'єкт пустий"))
      }, timeout)
    })
  }
  // Ми викликаємо getData з об'єктом { name: "John", age: 30, city: "New York" } і часом очікування 2000

  // Ми обробляємо дані, повернуті промісом
  // У разі успіху виводимо в консоль дані
  // У разі помилки виводимо повідомлення помилки
  // Незалежно від того, завершилось виконання проміса успіхом чи ні виводимо в консоль "Завдання 1 завершено"
  getData({ name: 'John', age: 30, city: 'New York' }, 2000)
}

// Викликаємо функцію task1
task1()
// =====================================================================================================
console.log('Завдання: 2 ==============================')

// Створюємо функцію task2
function task2() {
  // Створюємо функцію promise1
  // Повертаємо новий проміс
  // Використовуємо setTimeout для імітації асинхронної операції, яка завершується через 2 секунди.
  // Після 2 секунд викликаємо resolve з результатом проміса, який є рядком "Проміс 1 виконано"
  // Створюємо функцію promise2
  // Повертаємо новий проміс
  // Використовуємо setTimeout для імітації асинхронної операції, яка завершується через 5 секунди.
  // Після 5 секунд викликаємо resolve з результатом проміса, який є рядком "Проміс 2 виконано"
  // Використовуємо Promise.race для визначення, який проміс виконується першим.
  // Метод повертає новий проміс, який вирішується або відхиляється негайно після розв'язання або відхилення будь-якого з промісів у переданому списку.
  // У разі успіху виводимо результат
  // У разі помилки виводимо повідомлення про помилку
  // Незалежно від результату, виводимо повідомлення про завершення обробки промісів, який є рядом "Завдання 2 завершено"
  function promise1() {
    return new Promise((resolve) => {
      setTimeout(() => {
        resolve('Проміс 1 виконано')
      }, 2000)
    })
  }
  function promise2() {
    return new Promise((resolve) => {
      setTimeout(() => {
        resolve('Проміс 2 виконано')
      }, 5000)
    })
  }
  Promise.race([promise1(), promise2()]).finally(() => {
    console.log('Завдання 2 завершено')
  })
}

// Викликаємо функцію task2
task2()
// =====================================================================================================
console.log('Завдання: 3 ==============================')

// Створюємо функцію task3, в якій буде виконуватися завдання
function task3() {
  // Створюємо функцію promise1, яка створює і повертає новий проміс
  // Метод new Promise приймає в якості параметра функцію (executor), яка має два параметри: resolve і reject.
  // Використовуємо setTimeout для імітації асинхронної операції, яка завершується через 1 секунду
  // Викликаємо resolve з рядком 'Проміс 1 виконано', що означає успішне вирішення проміса
  function promise1() {
    return new Promise((resolve) => {
      setTimeout(() => {
        resolve('Проміс 1 виконано')
      }, 1000)
    })
  }
  // Створюємо функцію promise2, яка створює і повертає новий проміс, який відхиляється
  // Використовуємо setTimeout для імітації асинхронної операції, яка не вдається і відхиляє проміс через 2 секунди
  // Викликаємо reject з рядком 'Проміс 2 відхилено', що означає відхилення проміса
  function promise2() {
    return new Promise((resolve, reject) => {
      setTimeout(() => {
        reject('Проміс 2 відхилено')
      }, 2000)
    })
  }
  // Використовуємо Promise.allSettled який приймає масив промісів і повертає новий проміс, який вирішується, коли всі проміси вирішено або відхилено
  // Він повертає масив об'єктів, кожний з яких відображає стан кожного проміса
  // Функція then викликається, коли проміс вирішено
  // Вона приймає результати промісів і обробляє їх
  // Для кожного результату виводимо статус проміса
  // Функція finally викликається після того, як проміс вирішено або відхилено
  // Вона використовується для виконання дій, які повинні виконуватися незалежно від того, чи було проміс вирішено чи відхилено
  // В нашому випадку ми просто виводимо повідомлення, "Завдання 3 завершено"
  Promise.allSettled([promise1(), promise2()])
    .then((results) => {
      results.forEach((result) => {
        console.log(result.status)
      })
    })
    .finally(() => {
      console.log('Завдання 3 завершено')
    })
}

// Викликаємо функцію task3
task3()
// =====================================================================================================
console.log('Завдання: 4 ==============================')

// Функція task4, яка буде використовувати проміси
function task4() {
  // Визначаємо перший проміс з іменем promise1
  // Функція promise1, повертає новий проміс
  // Ми викликаємо конструктор Promise, що приймає в якості аргументу функцію (executor function)
  // Ця функція приймає два аргументи: resolve і reject, які є функціями
  // Використовуємо функцію setTimeout, щоб симулювати асинхронну операцію
  // Ця функція приймає два аргументи: функцію, яку потрібно викликати після певного часу, і час у мілісекундах (1000 мс = 1 с)
  // Після 1 секунди викликаємо функцію resolve, яка змінює стан проміса на "виконано" і передає значення 'Проміс 1 виконано'
  function promise1() {
    return new Promise((resolve) => {
      setTimeout(() => {
        resolve('Проміс 1 виконано')
      }, 1000)
    })
  }
  // Визначаємо другий проміс з іменем promise2
  // Функція promise2, повертає новий проміс
  // Використовуємо функцію setTimeout, щоб симулювати асинхронну операцію з затримкою 1сек
  // Після 1 секунди викликаємо функцію resolve, яка змінює стан проміса на "виконано" і передає значення 'Проміс 2 виконано'
  function promise2() {
    return new Promise((resolve) => {
      setTimeout(() => {
        resolve('Проміс 2 виконано')
      }, 1000)
    })
  }
  // Promise.all приймає масив промісів і повертає новий проміс, який вирішується, коли всі вхідні проміси вирішені
  // Функція then викликається, коли проміс вирішений
  // Результати всіх вхідних промісів передаються у функцію then у вигляді масиву, виводимо в консоль масив
  // ['Проміс 1 виконано', 'Проміс 2 виконано']
  // Функція catch викликається, коли будь-який з промісів відхилено
  // Повідомлення про помилку від першого відхиленого проміса передається у функцію catch, виводимо в консоль помилку
  // Функція finally викликається незалежно від того, чи вирішено проміс, чи відхилено
  // Виводимо в консоль "Всі операції завершено"
  Promise.all([promise1(), promise2()])
    .then((results) => {
      console.log(results)
    })
    .catch((error) => {
      console.log(error)
    })
    .finally(() => {
      console.log('Всі операції завершено')
    })
}

// Викликаємо функцію task4
task4()
// =====================================================================================================
console.log('Завдання: 5 ==============================')

// Створюємо функцію task5, яка буде використовувати проміси.
function task5() {
  // Створюємо змінну counter яка буде лічильником та присвоюємо значення 0
  let counter = 0
  // Створюємо проміс з іменем intervalPromise.
  // Використовуємо функцію setInterval, щоб імітувати асинхронну операцію яка повторюється кожну секунду
  // збільшуючи лічильник на 1
  // Виводимо в консоль `Значення лічильника: ${counter}`
  // Коли лічильник досягає 5, використовуємо clearInterval та викликаємо resolve, який повертає значення лічильника.
  // Використовуємо .then метод для отримання значення, яке було передане у функцію resolve() в нашому промісі, та виводимо його в консоль.
  // Використовуємо .catch метод для обробки випадків, коли проміс переходить в стан "rejected". Та виводимо в консоль помилку.
  // Обробляємо помилку, якщо вона виникне
  // Ми використовуємо .finally метод для виконання дій незалежно від того, в якому стані завершився наш проміс, та виводимо повідомлення "Завершення лічильника"
  // Виконуємо код після завершення проміса
  const intervalPromise = new Promise((resolve, reject) => {
    const interval = setInterval(() => {
      counter++
      console.log(`Значення лічильника: ${counter}`)
      if (counter === 5) {
        clearInterval(interval)
        resolve(counter)
      }
    }, 1000)
  })
    .then((value) => {
      console.log(`Проміс зарезолвився з значенням: ${value}`)
    })
    .catch((error) => {
      console.log(`Проміс відхилився з помилкою: ${error}`)
    })
    .finally(() => {
      console.log('Завершення лічильника')
    })
  return intervalPromise
}
// Викликаємо функцію task5
task5()
// =====================================================================================================
console.log('Завдання: 6 ==============================')

// Створюємо функцію task6, яка використовує setImmediate та проміси.
function task6() {
  // Створюємо новий проміс.
  // Використовуємо функцію setImmediate, щоб виконати функцію асинхронно.
  // Генеруємо випадкове число від 0 до 1
  // Якщо випадкове число менше 0.5, резолвимо проміс з рядком Більше ніж 0.5.
  // Інакше відхиляемо проміс з рядком Менше ніж 0.5 .
  // Використовуємо then для обробки зарезолвленого проміса, та виводимо `Проміс зарезолвився з значенням: ${value}`.
  // Якщо проміс відхилено, обробляємо помилку за допомогою catch, та виводимо `Проміс відхилився з помилкою: ${error}`.
  // Використовуємо finally для виконання дій після завершення проміса, незалежно від його статусу, та виводимо "Проміс завершено".
  const promise = new Promise((resolve, reject) => {
    setImmediate(() => {
      const random = Math.random()
      random < 0.5
        ? resolve('Більше ніж 0.5')
        : reject(new Error('Менше ніж 0.5'))
    })
  })
    .then((value) => {
      console.log(`Проміс зарезолвився з значенням: ${value}`)
    })
    .catch((value) => {
      console.log(`Проміс відхилився з помилкою: ${value}`)
    })
    .finally(() => {
      console.log('Проміс завершено')
    })
}

// Викликаємо функцію task6
task6()
// =====================================================================================================
console.log('Завдання: 7 ==============================')

// Створюємо функцію task7, яка використовує setInterval та проміси.
function task7() {
  // Створюємо новий проміс.
  // Використовуємо функцію setInterval, щоб виконати функцію кожну секунду.
  // Отримаємо поточну дату та час
  // Отримуємо секунди з поточної дати
  // Виводимо в консоль повідомлення `Поточні секунди: ${seconds}`
  // Якщо поточні секунди кратні 10, очищуємо інтервал та резолвимо проміс з рядком "Поточні секунди кратні 10!".
  // Якщо поточні секунди кратні 3, очищуємо інтервал та відхиляємо проміс з рядком "Поточні секунди кратні 3!".
  // Використовуємо then для обробки зарезолвленого проміса, та виводимо в консоль `Проміс зарезолвився з значенням: ${value}` .
  // Якщо проміс відхилено, обробляємо помилку за допомогою catch, та виводимо в консоль `Проміс відхилився з помилкою: ${error}`.
  // Використовуємо finally для виконання дій після завершення проміса, незалежно від його статусу, та виводимо в консоль "Проміс завершено".
  const promise = new Promise((resolve, reject) => {
    const interval = setInterval(() => {
      const date = new Date()
      const seconds = date.getSeconds()
      console.log(`Поточні секунди: ${seconds}`)
      if (seconds % 10 === 0) {
        clearInterval(interval)
        resolve('Поточні секунди кратні 10!')
      }
      if (seconds % 3 === 0) {
        clearInterval(interval)
        reject(new Error('Поточні секунди кратні 3!'))
      }
    }, 1000)
  })
    .then((value) => {
      console.log(`Проміс зарезолвився з значенням: ${value}`)
    })
    .catch((error) => {
      console.log(`Проміс відхилився з помилкою: ${error}`)
    })
    .finally(() => {
      console.log('Проміс завершено')
    })
}

// Викликаємо функцію task7
task7()
// =====================================================================================================
console.log('Завдання: 8 ==============================')

function task8() {
  // Створюємо функцію fetchFakeData, яка симулює запит до сервера та повертає "дані" через Promise.resolve().
  // Створюємо fakeData константу з данними { name: "John",age: 30}
  // Використовуємо Promise.resolve(fakeData) для того, щоб створити вже зарезолвлений проміс.
  // Викликаємо функцію fetchFakeData
  // Якщо проміс виконаний успішно виводимо в консоль дані які він повертає
  // Якщо проміс виконаний з помилкою виводимо в консоль помилку
  function fetchFakeData() {
    const fakeData = { name: 'John', age: 30 }
    return Promise.resolve(fakeData)
  }
  fetchFakeData()
    .then((data) => {
      console.log(data)
    })
    .catch((error) => {
      console.log(error)
    })
}

// Викликаємо функцію task8
task8()
// =====================================================================================================
console.log('Завдання: 9 ==============================')

function task9() {
  // Створюємо функцію fetchWithError, яка симулює помилку при запиті до сервера.
  // Створюємо константу errorMessage в яку записуємо рядок "Помилка при з'єднанні з сервером"
  // Використовуємо Promise.reject(errorMessage) для створення вже відхиленого промісу.
  // Викликаємо функцію fetchWithError
  // Якщо проміс виконаний успішно виводимо в консоль дані які він повертає
  // Якщо проміс виконаний з помилкою виводимо в консоль помилку
  function fetchWithError() {
    const errorMessage = "Помилка при з'єднанні з сервером"
    return Promise.reject(errorMessage)
  }
  fetchWithError()
    .then((data) => {
      console.log(data)
    })
    .catch((error) => {
      console.log(error)
    })
}

// Викликаємо функцію task10
task9()
// =====================================================================================================
console.log('Завдання: 10 ==============================')

function task10() {
  // Створюємо проміс promise1, які вирішуються через 500мс, та повертають як успішне виконання рядок "Promise 1".
  // Створюємо проміс promise2, які вирішуються через 200мс, та повертають як успішне виконання рядок "Promise 2".
  // Створюємо проміс promise3, які вирішуються через 300мс, та повертають як успішне виконання рядок "Promise 3".
  // Promise.any() приймає масив промісів які ми створили вище і вирішується, як тільки перший із цих промісів вирішується.
  // Якщо проміс виконаний успішно виводимо в консоль дані які він повертає
  // Якщо проміс виконаний з помилкою виводимо в консоль помилку
  const promise1 = new Promise((resolve) => {
    setTimeout(() => {
      resolve('Promise 1')
    }, 500)
  })
  const promise2 = new Promise((resolve) => {
    setTimeout(() => {
      resolve('Promise 2')
    }, 200)
  })
  const promise3 = new Promise((resolve) => {
    setTimeout(() => {
      resolve('Promise 3')
    }, 300)
  })
  Promise.any([promise1, promise2, promise3])
    .then((value) => {
      console.log(value)
    })
    .catch((error) => {
      console.log(error)
    })
}

// Викликаємо функцію task10
task10()
